In [71]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id pelajaran  nilai jenis-kelamin kelas
0         1    Fisika     23     laki-laki   12C
1         2   Geologi     42     laki-laki   12A
2         3    Fisika     35     perempuan   12B
3         4     Kimia     93     laki-laki   12A
4         5   Biologi     30     laki-laki   12A

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [72]:
# code here
df[["nilai","kelas"]].head()

   nilai kelas
0     23   12C
1     42   12A
2     35   12B
3     93   12A
4     30   12A

In [73]:
df.loc[4:9,["pelajaran",'nilai']]

  pelajaran  nilai
4   Biologi     30
5   Geologi     11
6     Kimia     89
7   Geologi     79
8   Ekonomi      9
9   Ekonomi     31

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [74]:
# code here
eko   = df.pelajaran == "Ekonomi" 
fis   = df.pelajaran == "Fisika"
nil50 = df.nilai >50
kim   = df.pelajaran == "Kimia"
nil70 = df.nilai >70
per   = df.loc[:,["jenis-kelamin"]].squeeze()=="perempuan"
kel   = df.kelas=="12C"

In [75]:
# code here
a = df[eko]
a if len(a)!=0 else "No student"

   siswa_id pelajaran  nilai jenis-kelamin kelas
8         9   Ekonomi      9     laki-laki   12B
9        10   Ekonomi     31     laki-laki   12A

In [76]:
# code here
b = df[fis]
b if len(b)!=0 else "No student"

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     23     laki-laki   12C
2          3    Fisika     35     perempuan   12B
12        13    Fisika     48     perempuan   12A
13        14    Fisika      8     perempuan   12D
14        15    Fisika     20     perempuan   12A
19        20    Fisika     74     perempuan   12A

In [77]:
# code here
c= df[nil50&kim]
c if len(c)!=0 else "No student"

   siswa_id pelajaran  nilai jenis-kelamin kelas
3         4     Kimia     93     laki-laki   12A
6         7     Kimia     89     perempuan   12A

In [78]:
# code here
d = df[nil70&per&kel]
d if len(d)!=0 else "No student"

'No student'

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [86]:
# code here
def norm_form(x):
    return (x-x.min())/(x.max()-x.min())

df[["nilai"]].apply(norm_form)

       nilai
0   0.186047
1   0.406977
2   0.325581
3   1.000000
4   0.267442
5   0.046512
6   0.953488
7   0.837209
8   0.023256
9   0.279070
10  0.058140
11  0.023256
12  0.476744
13  0.011628
14  0.151163
15  0.337209
16  0.313953
17  0.395349
18  0.000000
19  0.779070